Revit 2027 API
FailureMessage.GetDefaultResolutionCaption Method
 Retrieves the caption of the default resolution of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetDefaultResolutionCaption()
Public Function GetDefaultResolutionCaption As String
public:
String^ GetDefaultResolutionCaption()
member GetDefaultResolutionCaption : unit -> string
Return Value
String
 The caption of the default resolution of the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessage does not have any resolutions.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace